In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# setting path variable as root
path = r'C:\Users\shrut\Downloads\Task_data_analytics\Instacart Basket Analysis'

In [37]:
# defining dataframe of customers.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [38]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [39]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [40]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [41]:
 # changing datatype
df_cust['user_id'] = df_cust['user_id'].astype('int32')

In [42]:
 # changing column names to standard form
# changing the name of columns 
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df_cust.rename(columns = {'STATE': 'state'}, inplace = True)
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)
df_cust.rename(columns = {'n_dependants' : 'num_of_dependants'}, inplace = True)

In [43]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int32
 1   first_name         194950 non-null  object
 2   surname            206209 non-null  object
 3   gender             206209 non-null  object
 4   state              206209 non-null  object
 5   age                206209 non-null  int64
 6   date_joined        206209 non-null  object
 7   num_of_dependants  206209 non-null  int64
 8   marital_status     206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int32(1), int64(3), object(6)
memory usage: 14.9+ MB

In [44]:
df_cust.isnull().sum()

user_id                  0
first_name           11259
surname                  0
gender                   0
state                    0
age                      0
date_joined              0
num_of_dependants        0
marital_status           0
income                   0
dtype: int64

In [46]:
#addressing missing values is imputation
df_cust['first_name'].fillna('Unknown', inplace = True)

In [47]:
df_cust.shape

(206209, 10)

In [48]:
#duplicates
df_dups = df_cust[df_cust.duplicated()] #no duplicates

In [49]:
# Check for mixed datatype in df_ords # output first_name and then changed and ran which retrieved no columns

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [50]:
df_cust['first_name'] = df_cust['first_name'].astype('str') # changed to uniform datatype

In [52]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int32
 1   first_name         206209 non-null  object
 2   surname            206209 non-null  object
 3   gender             206209 non-null  object
 4   state              206209 non-null  object
 5   age                206209 non-null  int64
 6   date_joined        206209 non-null  object
 7   num_of_dependants  206209 non-null  int64
 8   marital_status     206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int32(1), int64(3), object(6)
memory usage: 14.9+ MB

In [54]:
# Change datatype to save memory
df_cust['age'] = df_cust['age'].astype('int8')
df_cust['num_of_dependants'] = df_cust['num_of_dependants'].astype('int8')

In [55]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int32
 1   first_name         206209 non-null  object
 2   surname            206209 non-null  object
 3   gender             206209 non-null  object
 4   state              206209 non-null  object
 5   age                206209 non-null  int8
 6   date_joined        206209 non-null  object
 7   num_of_dependants  206209 non-null  int8
 8   marital_status     206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int32(1), int64(1), int8(2), object(6)
memory usage: 12.2+ MB

In [56]:
df_cust.isnull().sum()

user_id              0
first_name           0
surname              0
gender               0
state                0
age                  0
date_joined          0
num_of_dependants    0
marital_status       0
income               0
dtype: int64

In [24]:
# importing the merged and updated pkl dataset
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped.pkl'))

In [57]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 23 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int8
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int8
 12  prices                     float64
 13  _merge                     category
 14  busiest_day                object
 15  busiest_days               object
 16  busiest_period_of_day      object
 17  max_order                  int8
 18  loyalty_flag               object
 19  mean_price                 float64
 20  spend_flag                 object
 21  median_days_prev_order     float16
 22  regularity_flag            object
dtypes: category(1), float16(2), float64(2), int32(4), int8(7), object(7)
memory usage: 3.0+ GB

In [58]:
#merging ords_prods_merge with customer df on user_id
ords_prods_customer_merge = ords_prods_merge.merge(df_cust, on = ['user_id'])

In [59]:
ords_prods_customer_merge.shape

(32434212, 32)

In [60]:
ords_prods_customer_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,regularity_flag,first_name,surname,gender,state,age,date_joined,num_of_dependants,marital_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [61]:
# export ords_prods_customer_merge as a pickle file 
ords_prods_customer_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customer_merge.pkl'))

In [62]:
ords_prods_customer_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 32 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int8
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int8
 12  prices                     float64
 13  _merge                     category
 14  busiest_day                object
 15  busiest_days               object
 16  busiest_period_of_day      object
 17  max_order                  int8
 18  loyalty_flag               object
 19  mean_price                 float64
 20  spend_flag                 object
 21  median_days_prev_order     float16
 22  regularity_flag            object
 23  first_name                 object
 24  surname                    object
 25  gender                     object
 26  state                      object
 27  age                        int8
 28  date_joined                object
 29  num_of_dependants          int8
 30  marital_status             object
 31  income                     int64
dtypes: category(1), float16(2), float64(2), int32(4), int64(1), int8(9), object(13)
memory usage: 4.8+ GB